RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_НастройкиПрограммы/рдв_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>рдв_НастройкиПрограммы</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Characteristic.рдв_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.рдв_ВидыЗначенийНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рдв_НастройкиПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначенияНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПовторноИспользуемыеЗначения</name>
    <comment>VELO-1699</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеЗначений</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рдв_НастройкиПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

RDVMI.rdvmi-ext/src/Enums/рдв_ВидыЗначенийНастроек/рдв_ВидыЗначенийНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ВидыЗначенийНастроек</name>
  <comment>VELO-613</comment>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>СписокЗначений</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/ChartsOfCharacteristicTypes/рдв_НастройкиПрограммы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Представление значения
	
	ПредставлениеЗначенияНастройки = "";
	
	Если ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Значение Тогда
		
		ПредставлениеЗначенияНастройки = Строка(Значение);
		
	ИначеЕсли ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.СписокЗначений Тогда
		
		ЧастиПредставления = Значения.ВыгрузитьКолонку("Значение");
		ПредставлениеЗначенияНастройки = СтрСоединить(ЧастиПредставления, "; ");
		
	ИначеЕсли ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Соответствие Тогда
		
		ЧастиПредставления = Новый Массив();
		Для Каждого Строка Из СоответствиеЗначений Цикл
			ЧастиПредставления.Добавить(
				СтрШаблон("%1: %2", Строка.Ключ, Строка.Значение)
			);
		КонецЦикла;
		
		ПредставлениеЗначенияНастройки = СтрСоединить(ЧастиПредставления, "; ");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// VELO-1699 26.02.2024 dvasilev@rdv-it.com
	
	Если ОбновлятьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры
